## Summer Olympics Assignment

In [7]:
import numpy as np
import pandas as pd

In [8]:
summer = pd.read_csv("summer.csv")

In [9]:

summer.head(3)

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze

In [56]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [57]:
#No null value found in the dataset.

### In how many cities Summer Olympics is held so far?

In [26]:
summer['City'].nunique()

22

### Which sport is having most number of Gold Medals so far? (Top 5)

In [41]:
summer["Sport"].where(summer['Medal']=="Gold").dropna().value_counts().head()

Aquatics      1421
Athletics     1215
Rowing         890
Gymnastics     820
Fencing        552
Name: Sport, dtype: int64

### Which sport is having most number of medals so far? (Top 5)

In [51]:
df = summer[["Sport","Medal"]]
df["Sport"].value_counts().sum()

31165

In [53]:
df["Medal"].value_counts().sum()

31165

As, there are no null values and both the coloumns have the same amount of values then This means that the sport occuring most number of times in the list will have most number of medals,

In [54]:
df["Sport"].value_counts().head()

Aquatics      4170
Athletics     3638
Rowing        2667
Gymnastics    2307
Fencing       1613
Name: Sport, dtype: int64

### Which player has won most number of medals? (Top 5)¶

In [64]:
summer["Athlete"].value_counts().head(5)

PHELPS, Michael       22
LATYNINA, Larisa      18
ANDRIANOV, Nikolay    15
SHAKHLIN, Boris       13
ONO, Takashi          13
Name: Athlete, dtype: int64

### Which player has won most number Gold Medals of medals? (Top 5)

In [65]:
summer["Athlete"].where(summer.Medal == "Gold").value_counts().head(5)

PHELPS, Michael     18
SPITZ, Mark          9
NURMI, Paavo         9
LATYNINA, Larisa     9
LEWIS, Carl          9
Name: Athlete, dtype: int64

### In which year India won first Gold Medal in Summer Olympics?

In [70]:
summer[["Year","Medal"]].where(summer.Country == "IND").dropna()

         Year   Medal
241    1900.0  Silver
244    1900.0  Silver
5512   1928.0    Gold
5513   1928.0    Gold
5514   1928.0    Gold
...       ...     ...
29879  2012.0  Bronze
30841  2012.0  Bronze
30849  2012.0  Silver
31111  2012.0  Bronze
31118  2012.0  Silver

[184 rows x 2 columns]

In [92]:
 new = summer[["Year","Medal","Country"]].where((summer.Country=="IND") & (summer.Medal== "Gold")).dropna()

In [93]:
new.head(1)

        Year Medal Country
5512  1928.0  Gold     IND

### Which event is most popular in terms on number of players?

In [80]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [94]:
summer["Event"].value_counts().head()

Football            1497
Hockey              1422
Team Competition    1147
Basketball          1012
Handball             973
Name: Event, dtype: int64

### Which sport is having most female Gold Medalists? (Top 5)

In [87]:
new = summer["Sport"].where((summer.Gender=="Women") & (summer.Medal== "Gold")).value_counts()

In [88]:
new.head()

Aquatics      589
Athletics     389
Gymnastics    268
Rowing        217
Volleyball    166
Name: Sport, dtype: int64